In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame(
    {
        'id':[1,2],
        'store_nbr': [1,2],
        'family': ['POULTRY','PRODUCE']
    }
)

   id  store_nbr   family
0   1          1  POULTRY
1   2          2  PRODUCE

In [3]:
oil = pd.read_csv('retail/oil.csv')

In [4]:
path_retail = "retail/retail_2016_2017.csv"
retail = pd.read_csv(path_retail)

In [5]:
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [6]:
oil.shape

(1218, 2)

In [7]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [8]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [9]:
oil.columns = ['price date','oil price']

In [10]:
oil

      price date  oil price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [11]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price date', 'oil price'], dtype='object')]

In [12]:
oil.dtypes

price date     object
oil price     float64
dtype: object

In [13]:
oil.head()

   price date  oil price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [14]:
oil.head(6)

   price date  oil price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20
5  2013-01-08      93.21

In [15]:
oil.sample(5)

     price date  oil price
164  2013-08-19     107.14
157  2013-08-08     103.45
663  2015-07-17      50.88
588  2015-04-03        NaN
713  2015-09-25      45.55

In [16]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   object
 1   oil price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [17]:
oil.describe()

         oil price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [18]:
oil.describe().loc['std','oil price']

25.630475729453224

In [19]:
oil.sample(5, random_state=12345)

      price date  oil price
656   2015-07-08      51.61
502   2014-12-04      66.73
111   2013-06-05      93.66
1134  2017-05-08      46.46
931   2016-07-27      41.90

In [20]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   object
 1   oil price   1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [21]:
oil.describe(include='all').round()

        price date  oil price
count         1218     1175.0
unique        1218        NaN
top     2013-01-01        NaN
freq             1        NaN
mean           NaN       68.0
std            NaN       26.0
min            NaN       26.0
25%            NaN       46.0
50%            NaN       53.0
75%            NaN       96.0
max            NaN      111.0

In [22]:
oil

      price date  oil price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [23]:
oil.columns = ['price_date','oil_price']

In [24]:
oil.price_date

0       2013-01-01
1       2013-01-02
2       2013-01-03
3       2013-01-04
4       2013-01-07
           ...
1213    2017-08-25
1214    2017-08-28
1215    2017-08-29
1216    2017-08-30
1217    2017-08-31
Name: price_date, Length: 1218, dtype: object

In [25]:
oil['price_date'].iloc[:5]

0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
4    2013-01-07
Name: price_date, dtype: object

In [26]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [27]:
retail[['family','store_nbr']] # return dataframe

                             family  store_nbr
0                        AUTOMOTIVE          1
1                         BABY CARE          1
2                            BEAUTY          1
3                         BEVERAGES          1
4                             BOOKS          1
...                             ...        ...
1054939                     POULTRY          9
1054940              PREPARED FOODS          9
1054941                     PRODUCE          9
1054942  SCHOOL AND OFFICE SUPPLIES          9
1054943                     SEAFOOD          9

[1054944 rows x 2 columns]

In [28]:
retail[['family']] # return dataframe by passing a list as argument

                             family
0                        AUTOMOTIVE
1                         BABY CARE
2                            BEAUTY
3                         BEVERAGES
4                             BOOKS
...                             ...
1054939                     POULTRY
1054940              PREPARED FOODS
1054941                     PRODUCE
1054942  SCHOOL AND OFFICE SUPPLIES
1054943                     SEAFOOD

[1054944 rows x 1 columns]

In [29]:
retail['family'] # return series

0                          AUTOMOTIVE
1                           BABY CARE
2                              BEAUTY
3                           BEVERAGES
4                               BOOKS
                      ...
1054939                       POULTRY
1054940                PREPARED FOODS
1054941                       PRODUCE
1054942    SCHOOL AND OFFICE SUPPLIES
1054943                       SEAFOOD
Name: family, Length: 1054944, dtype: object

In [30]:
retail.iloc[:5,1:4] #first 5 rows, 2-4 columns

         date  store_nbr      family
0  2016-01-01          1  AUTOMOTIVE
1  2016-01-01          1   BABY CARE
2  2016-01-01          1      BEAUTY
3  2016-01-01          1   BEVERAGES
4  2016-01-01          1       BOOKS

In [31]:
retail.loc[:,'date']

0          2016-01-01
1          2016-01-01
2          2016-01-01
3          2016-01-01
4          2016-01-01
              ...
1054939    2017-08-15
1054940    2017-08-15
1054941    2017-08-15
1054942    2017-08-15
1054943    2017-08-15
Name: date, Length: 1054944, dtype: object

In [32]:
retail.loc[:,['date']]

               date
0        2016-01-01
1        2016-01-01
2        2016-01-01
3        2016-01-01
4        2016-01-01
...             ...
1054939  2017-08-15
1054940  2017-08-15
1054941  2017-08-15
1054942  2017-08-15
1054943  2017-08-15

[1054944 rows x 1 columns]

In [33]:
retail.loc[:,'date':'sales']

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [34]:
oil.head()

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [35]:
oil.iloc[:10,0:1]

   price_date
0  2013-01-01
1  2013-01-02
2  2013-01-03
3  2013-01-04
4  2013-01-07
5  2013-01-08
6  2013-01-09
7  2013-01-10
8  2013-01-11
9  2013-01-14

In [36]:
oil.iloc[:10,[-1]]

   oil_price
0        NaN
1      93.14
2      92.97
3      93.12
4      93.20
5      93.21
6      93.08
7      93.81
8      93.60
9      94.27

In [37]:
oil.iloc[:10,-2:-1]

   price_date
0  2013-01-01
1  2013-01-02
2  2013-01-03
3  2013-01-04
4  2013-01-07
5  2013-01-08
6  2013-01-09
7  2013-01-10
8  2013-01-11
9  2013-01-14

In [38]:
oil.loc[0:5,:] # loc last row inclusive

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20
5  2013-01-08      93.21

In [39]:
oil.iloc[0:5,:] # iloc last row exclusive

   price_date  oil_price
0  2013-01-01        NaN
1  2013-01-02      93.14
2  2013-01-03      92.97
3  2013-01-04      93.12
4  2013-01-07      93.20

In [40]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [41]:
retail.drop('id',axis=1)

,date,store_nbr,family,sales,onpromotion
0,2016-01-01,1,AUTOMOTIVE,0.000,0
1,2016-01-01,1,BABY CARE,0.000,0
2,2016-01-01,1,BEAUTY,0.000,0
3,2016-01-01,1,BEVERAGES,0.000,0
4,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...
1054939,2017-08-15,9,POULTRY,438.133,0
1054940,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,2017-08-15,9,PRODUCE,2419.729,148
1054942,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,2017-08-15,9,SEAFOOD,16.000,0

In [43]:
retail.drop(['id','onpromotion'],inplace=True,axis=1)

In [44]:
retail

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [46]:
retail.drop(0,axis=0)

               date  store_nbr                      family     sales
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
5        2016-01-01          1                BREAD/BAKERY     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054943 rows x 4 columns]

In [48]:
retail.drop(range(5),axis=0)

               date  store_nbr                      family     sales
5        2016-01-01          1                BREAD/BAKERY     0.000
6        2016-01-01          1                 CELEBRATION     0.000
7        2016-01-01          1                    CLEANING     0.000
8        2016-01-01          1                       DAIRY     0.000
9        2016-01-01          1                        DELI     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054939 rows x 4 columns]

In [49]:
retail.shape

(1054944, 4)

In [50]:
retail.nunique()

date            592
store_nbr        54
family           33
sales        181592
dtype: int64

In [58]:
retail.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
1054939    False
1054940    False
1054941    False
1054942    False
1054943    False
Length: 1054944, dtype: bool

In [57]:
retail.duplicated().loc[retail.duplicated() == False]

0          False
1          False
2          False
3          False
4          False
           ...
1054939    False
1054940    False
1054941    False
1054942    False
1054943    False
Length: 1054944, dtype: bool

In [59]:
retail

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [60]:
retail.duplicated(subset='family')

0          False
1          False
2          False
3          False
4          False
           ...
1054939     True
1054940     True
1054941     True
1054942     True
1054943     True
Length: 1054944, dtype: bool

In [61]:
retail.drop_duplicates()

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [62]:
retail.drop_duplicates(subset='family', keep='last',ignore_index=True)

          date  store_nbr                      family     sales
0   2017-08-15          9                  AUTOMOTIVE    15.000
1   2017-08-15          9                   BABY CARE     0.000
2   2017-08-15          9                      BEAUTY    10.000
3   2017-08-15          9                   BEVERAGES  3530.000
4   2017-08-15          9                       BOOKS     0.000
5   2017-08-15          9                BREAD/BAKERY   528.000
6   2017-08-15          9                 CELEBRATION    16.000
7   2017-08-15          9                    CLEANING  1439.000
8   2017-08-15          9                       DAIRY   835.000
9   2017-08-15          9                        DELI   551.713
10  2017-08-15          9                        EGGS   244.000
11  2017-08-15          9                FROZEN FOODS   133.738
12  2017-08-15          9                   GROCERY I  6630.383
13  2017-08-15          9                  GROCERY II     9.000
14  2017-08-15          9                    HARDWARE     1.000
15  2017-08-15          9          HOME AND KITCHEN I    64.000
16  2017-08-15          9         HOME AND KITCHEN II    61.000
17  2017-08-15          9             HOME APPLIANCES     0.000
18  2017-08-15          9                   HOME CARE   373.000
19  2017-08-15          9                  LADIESWEAR    10.000
20  2017-08-15          9             LAWN AND GARDEN    11.000
21  2017-08-15          9                    LINGERIE     6.000
22  2017-08-15          9            LIQUOR,WINE,BEER    25.000
23  2017-08-15          9                   MAGAZINES    11.000
24  2017-08-15          9                       MEATS   449.228
25  2017-08-15          9               PERSONAL CARE   522.000
26  2017-08-15          9                PET SUPPLIES     6.000
27  2017-08-15          9     PLAYERS AND ELECTRONICS     6.000
28  2017-08-15          9                     POULTRY   438.133
29  2017-08-15          9              PREPARED FOODS   154.553
30  2017-08-15          9                     PRODUCE  2419.729
31  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
32  2017-08-15          9                     SEAFOOD    16.000

In [66]:
oil = oil.append(oil.iloc[-1]).reset_index(drop=True)

C:\Users\macie\AppData\Local\Temp\ipykernel_21036\2701637165.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  oil = oil.append(oil.iloc[-1]).reset_index(drop=True)

In [67]:
oil

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26
1218  2017-08-31      47.26

[1219 rows x 2 columns]

In [68]:
oil.shape

(1219, 2)

In [69]:
oil.nunique(dropna=False)

price_date    1218
oil_price      999
dtype: int64

In [73]:
oil.duplicated(subset='oil_price').sum()

220

In [74]:
oil.drop_duplicates()

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26

[1218 rows x 2 columns]

In [75]:
oil.drop_duplicates(keep='last')

      price_date  oil_price
0     2013-01-01        NaN
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1213  2017-08-25      47.65
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1218  2017-08-31      47.26

[1218 rows x 2 columns]

In [77]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1219 entries, 0 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1219 non-null   object
 1   oil_price   1176 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [79]:
oil.fillna(0).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1219 entries, 0 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1219 non-null   object
 1   oil_price   1219 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [81]:
oil.fillna({'oil_price': 0}) # fill specific column

      price_date  oil_price
0     2013-01-01       0.00
1     2013-01-02      93.14
2     2013-01-03      92.97
3     2013-01-04      93.12
4     2013-01-07      93.20
...          ...        ...
1214  2017-08-28      46.40
1215  2017-08-29      46.46
1216  2017-08-30      45.96
1217  2017-08-31      47.26
1218  2017-08-31      47.26

[1219 rows x 2 columns]

In [82]:
oil.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1176 entries, 1 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1176 non-null   object
 1   oil_price   1176 non-null   float64
dtypes: float64(1), object(1)
memory usage: 27.6+ KB

In [84]:
oil.dropna(subset='oil_price').info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1176 entries, 1 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1176 non-null   object
 1   oil_price   1176 non-null   float64
dtypes: float64(1), object(1)
memory usage: 27.6+ KB